In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'name' : ['Anna', 'Bob', 'Charlie', 'Daiana', 'Eric'],
    'Age'  : [20, 34, 23, None, 33],
    'Gender' : ['f', 'm', 'm', 'f', 'm'],
    'Job'  : ['Programmer', 'Writer', 'Cook', 'Programmer', 'Teacher']
}

In [4]:
df = pd.DataFrame(data)
df

      name   Age Gender         Job
0     Anna  20.0      f  Programmer
1      Bob  34.0      m      Writer
2  Charlie  23.0      m        Cook
3   Daiana   NaN      f  Programmer
4     Eric  33.0      m     Teacher